src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПоступлениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ea24046-be85-4b3a-a7fb-94daa9d5fd13">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5e6796ec-3e70-4c2b-bfd3-734561cf90ee">
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f821e82b-1396-4cc3-b7e8-c44de00ea420">
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="38ae23fc-25c4-4c92-adaa-c82453712b32">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6b6b5a9-764c-4b57-9769-042ea6bf7581">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a91451d2-f8b3-4ea7-83e6-c95f5ae8d662">
    <name>ПодразделениеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="726ebb84-7974-4d9f-a2e6-33fbab82380d">
    <name>РучнаяКорректировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73b5e625-ebb5-4178-8cc0-960843f75cea">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b6076129-af23-479c-86e9-e591eb40a244">
    <name>СпособЗачетаАвансов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="006e1000-e354-4c40-88f7-fdcb1897326b">
    <name>СуммаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aeb99934-f54a-4896-bffb-39f0a61b015c">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cb1302b9-3f01-48b0-8149-955656f1f5b1">
    <name>ТипЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0faa80a2-8a4b-4882-88bf-f343e422ab71">
      <name>ДоговорКонтрагента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="396743c0-9652-4280-b8f2-b4c77cbed751">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5775cf55-4a2c-40bd-bfbc-567d71330811">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1a445c0b-4467-4e89-af38-298cab058550">
    <name>АгентскиеУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ff4e80f3-34f0-4240-bdea-aa0631fc0539">
      <name>ДоговорКонтрагента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/УстановкаЦенНоменклатуры/УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>УстановкаЦенНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеПроводитьНулевыеЗначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f7e45c4-ad85-4100-870c-63a57ffb2fe9">
    <name>Информация</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеТоваровУслуг/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура Базар_ОбработкаПроведения(Отказ, РежимПроведения)
	
	СистемныеНастройкиБазар = ОбщегоНазначенияБазарСервер.СистемныеНастройкиБазар(Дата);
	
	Если ЗначениеЗаполнено(СистемныеНастройкиБазар.ТипЦенСебестоимость) тогда
		ЗаполнитьДокументУстановкаЦенНоменклатуры(СистемныеНастройкиБазар.ТипЦенСебестоимость);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СистемныеНастройкиБазар.ТипЦенПродажи) тогда
		ЗаполнитьДокументУстановкаЦенНоменклатуры(СистемныеНастройкиБазар.ТипЦенПродажи);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СистемныеНастройкиБазар.ТипЦенРозницы) тогда
		ЗаполнитьДокументУстановкаЦенНоменклатуры(СистемныеНастройкиБазар.ТипЦенРозницы);
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Базар_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() тогда
		
		СуммаВключаетНДС = Истина;
		
		Если НЕ ЗначениеЗаполнено(Склад) тогда
			СистемныеНастройкиБазар = ОбщегоНазначенияБазарСервер.СистемныеНастройкиБазар(Дата);
			Если ЗначениеЗаполнено(СистемныеНастройкиБазар.СкладОтгрузки) тогда
				Склад = СистемныеНастройкиБазар.СкладОтгрузки;
			КонецЕсли;
			Если ЗначениеЗаполнено(СистемныеНастройкиБазар.ТипЦенСебестоимость) тогда
				ТипЦен = СистемныеНастройкиБазар.ТипЦенСебестоимость;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументУстановкаЦенНоменклатуры(ТипЦен)
	
	Если НЕ ЗначениеЗаполнено(ТипЦен) тогда
		Возврат;
	КонецЕсли;
	
	УстановкиЦенНоменклатуры = Ценообразование.НайтиУстановкиЦенНоменклатуры(Ссылка, ТипЦен);
	Если УстановкиЦенНоменклатуры = Неопределено тогда
		ОбъектУстановкаЦенНоменклатуры = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	Иначе
		ОбъектУстановкаЦенНоменклатуры = УстановкиЦенНоменклатуры.Получить(0).ПолучитьОбъект();
	КонецЕсли;
	
	ОбъектУстановкаЦенНоменклатуры.Дата                       = Дата;
	ОбъектУстановкаЦенНоменклатуры.ДокументОснование          = Ссылка;
	ОбъектУстановкаЦенНоменклатуры.ТипЦен                     = ТипЦен;
	ОбъектУстановкаЦенНоменклатуры.Ответственный              = Ответственный;
	ОбъектУстановкаЦенНоменклатуры.Комментарий                = "Автоматическое создание документа. Основание: Проведение документа "+Ссылка;
	ОбъектУстановкаЦенНоменклатуры.НеПроводитьНулевыеЗначения = Истина;
	ОбъектУстановкаЦенНоменклатуры.ПометкаУдаления            = Ложь;
	
	ОбъектУстановкаЦенНоменклатуры.Товары.Очистить();
	Для Каждого СтрокаТовары из Товары цикл
		
		НоваяСтрокаТовары = ОбъектУстановкаЦенНоменклатуры.Товары.Добавить();
		НоваяСтрокаТовары.Номенклатура = СтрокаТовары.Номенклатура;
		НоваяСтрокаТовары.Валюта = ВалютаДокумента;
		
		Если ЗначениеЗаполнено(ТипЦен.БазовыйТипЦен) тогда
			ПолученнаяЦена = СтрокаТовары.Цена + (СтрокаТовары.Цена * ТипЦен.ПроцентСкидкиНаценки / 100);
		Иначе
			ПолученнаяЦена = СтрокаТовары.Цена;
		КонецЕсли;
		
		НоваяСтрокаТовары.Цена = Ценообразование.ОкруглитьЦену(ПолученнаяЦена, ТипЦен);
		
	КонецЦикла;
	
	ОбъектУстановкаЦенНоменклатуры.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Базар_ОбработкаУдаленияПроведения(Отказ)
	
	УстановкиЦенНоменклатуры = Ценообразование.НайтиУстановкиЦенНоменклатуры(Ссылка);
	Если УстановкиЦенНоменклатуры = Неопределено тогда
		Возврат;
	Иначе
		Для Каждого СсылкаУстановкаЦенНоменклатуры из УстановкиЦенНоменклатуры цикл
			ОбъектУстановкаЦенНоменклатуры = СсылкаУстановкаЦенНоменклатуры.ПолучитьОбъект();
			ОбъектУстановкаЦенНоменклатуры.Записать(РежимЗаписиДокумента.ОтменаПроведения,
			                                        РежимПроведенияДокумента.Неоперативный);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Базар_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Обработка пометки на удаление
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления тогда
		
		УстановкиЦенНоменклатуры = Ценообразование.НайтиУстановкиЦенНоменклатуры(Ссылка);
		Если УстановкиЦенНоменклатуры = Неопределено тогда
			Возврат;
			
		Иначе
			Для Каждого СсылкаУстановкаЦенНоменклатуры из УстановкиЦенНоменклатуры цикл
				
				ОбъектУстановкаЦенНоменклатуры = СсылкаУстановкаЦенНоменклатуры.ПолучитьОбъект();
				ОбъектУстановкаЦенНоменклатуры.ПометкаУдаления = ПометкаУдаления;
				
				Если ПометкаУдаления тогда
					ОбъектУстановкаЦенНоменклатуры.Записать(РежимЗаписиДокумента.ОтменаПроведения,
					                                        РежимПроведенияДокумента.Неоперативный);
				Иначе
					Если Проведен тогда
						ОбъектУстановкаЦенНоменклатуры.Записать(РежимЗаписиДокумента.Проведение,
						                                        РежимПроведенияДокумента.Неоперативный);
					Иначе
						ОбъектУстановкаЦенНоменклатуры.Записать(РежимЗаписиДокумента.Запись,
						                                        РежимПроведенияДокумента.Неоперативный);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
